online-throughput/k6/tp-results-draft-model/bench-draft-model-c4.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f38c87816c0>, seed=0, num_prompts=50, dataset_name='hf', no_stream=False, dataset_path='likaixin/InstructCoder', no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=4, model='meta-llama/Llama-3.3-70B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=4.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-85528ca1-', top_p=1.0, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600, extra_body=None)
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
Initial test run completed.
Starting main benchmark run...
Traffic request rate: 4.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 4
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     50        
Failed requests:                         0         
Maximum request concurrency:             4         
Request rate configured (RPS):           4.00      
Benchmark duration (s):                  28.57     
Total input tokens:                      8501      
Total generated tokens:                  7328      
Request throughput (req/s):              1.75      
Output token throughput (tok/s):         256.46    
Peak output token throughput (tok/s):    59.00     
Peak concurrent requests:                7.00      
Total token throughput (tok/s):          553.97    
---------------Time to First Token----------------
Mean TTFT (ms):                          154.44    
Median TTFT (ms):                        151.10    
P99 TTFT (ms):                           212.44    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          13.79     
Median TPOT (ms):                        13.57     
P99 TPOT (ms):                           22.75     
---------------Inter-token Latency----------------
Mean ITL (ms):                           67.70     
Median ITL (ms):                         65.75     
P99 ITL (ms):                            97.49     
---------------Speculative Decoding---------------
Acceptance rate (%):                     66.04     
Acceptance length:                       4.96      
Drafts:                                  1472      
Draft tokens:                            8832      
Accepted tokens:                         5833      
Per-position acceptance (%):
  Position 0:                            84.17     
  Position 1:                            75.48     
  Position 2:                            66.37     
  Position 3:                            60.67     
  Position 4:                            56.86     
  Position 5:                            52.72     
==================================================